# Merge DataFrames in Pandas
---
Copied From : https://github.com/justmarkham/pandas-videos/blob/master/pandas_merge.ipynb  
Reference : https://pandas.pydata.org/docs/getting_started/comparison/comparison_with_sql.html

## Selecting a Function
---
 1. ```df1.append(df2)```: stacking vertically
 2. ```pd.concat([df1,df2])```:
   - Stacking mainly horizontally or vertically
   - simple inner/outer joins on indexes
 3. ```df1.join(df2)1```: inner/outer/left/right joins on indexes
 4. ```pd.merge(df1, df2)```: many joins on multiple columns
 
---

## Joining ( Merging ) DataFrames
Using the [MovieLens 100k data](http://grouplens.org/datasets/movielens/), let's create two DataFrames:

- **movies**: shows information about movies, namely a unique **movie_id** and its **title**
- **ratings**: shows the **rating** that a particular **user_id** gave to a particular **movie_id** at a particular **timestamp**

In [1]:
import pandas as pd

## Movies

In [75]:
movie_cols = ['movie_id','title']
col_type = {'movie_id':int, 'title':str}
movies = pd.read_csv('movies.csv', names = movie_cols, usecols=[0,1],header=0)
movies.head(10)

   movie_id                               title
0         1                    Toy Story (1995)
1         2                      Jumanji (1995)
2         3             Grumpier Old Men (1995)
3         4            Waiting to Exhale (1995)
4         5  Father of the Bride Part II (1995)
5         6                         Heat (1995)
6         7                      Sabrina (1995)
7         8                 Tom and Huck (1995)
8         9                 Sudden Death (1995)
9        10                    GoldenEye (1995)

In [76]:
movies.shape

(62423, 2)

In [77]:
movies.movie_id.nunique()

62423

## Ratings

In [80]:
rating_cols = ['user_id', 'movie_id', 'rating', 'timestamp']
col_type = {'userid':int, 'movieid':int, 'rating':float, 'timestamp':int}
ratings = pd.read_csv('ratings.csv', names=rating_cols, dtype=col_type, header =0)
ratings.head()

   user_id  movie_id  rating   timestamp
0        1       296     5.0  1147880044
1        1       306     3.5  1147868817
2        1       307     5.0  1147868828
3        1       665     5.0  1147878820
4        1       899     3.5  1147868510

In [79]:
pd.read_csv?

In [35]:
ratings.shape

(25000095, 4)

In [36]:
ratings.movie_id.nunique()

59047

In [38]:
ratings[ratings.movie_id ==1].head()

      user_id  movie_id  rating   timestamp
70          2         1     3.5  1141415820
254         3         1     4.0  1439472215
910         4         1     3.0  1573944252
1152        5         1     4.0   858625949
1304        8         1     4.0   890492517

### Merging Movies and Ratings
---
Let's pretend that we want to examine the ratings DataFrame, but we want to know the title of each movie rather than its movie_id. The best way to accomplish this objective is by "joining" (or "merging") the DataFrames using the Pandas merge function:

In [39]:
movies.columns

Index(['movie_id', 'title'], dtype='object')

In [41]:
ratings.columns

Index(['user_id', 'movie_id', 'rating', 'timestamp'], dtype='object')

In [44]:
movie_ratings = pd.merge(movies, ratings)
movie_ratings.columns

Index(['movie_id', 'title', 'user_id', 'rating', 'timestamp'], dtype='object')

In [45]:
movie_ratings.head()

   movie_id             title  user_id  rating   timestamp
0         1  Toy Story (1995)        2     3.5  1141415820
1         1  Toy Story (1995)        3     4.0  1439472215
2         1  Toy Story (1995)        4     3.0  1573944252
3         1  Toy Story (1995)        5     4.0   858625949
4         1  Toy Story (1995)        8     4.0   890492517

In [46]:
movie_ratings.shape

(25000095, 5)

Here's what just happened:

- Pandas noticed that movies and ratings had one column in common, namely movie_id. This is the "key" on which the DataFrames will be joined.
- The first movie_id in movies is 1. Thus, Pandas looked through every row in the ratings DataFrame, searching for a movie_id of 1. Every time it found such a row, it recorded the user_id, rating, and timestamp listed in that row. In this case, it found 452 matching rows.
- The second movie_id in movies is 2. Again, Pandas did a search of ratings and found 131 matching rows.
- This process was repeated for all of the remaining rows in movies.  

At the end of the process, the movie_ratings DataFrame is created, which contains the two columns from movies (movie_id and title) and the three other colums from ratings (user_id, rating, and timestamp).

- movie_id 1 and its title are listed 452 times, next to the user_id, rating, and timestamp for each of the 452 matching ratings.
- movie_id 2 and its title are listed 131 times, next to the user_id, rating, and timestamp for each of the 131 matching ratings.
- And so on, for every movie in the dataset.

In [47]:
print(movies.shape)
print(ratings.shape)
print(movie_ratings.shape)

(62423, 2)
(25000095, 4)
(25000095, 5)

## Few Conditions...
---

### If two tables (dataframes) do not have same column name then... specify the column name

In [82]:
#Update the column name
movies.columns = ['m_id', 'title']
movies.columns

Index(['m_id', 'title'], dtype='object')

In [83]:
#Check for the columns in the ratings dataframe

ratings.columns

Index(['user_id', 'movie_id', 'rating', 'timestamp'], dtype='object')

In [84]:
pd.merge(movies, ratings, left_on='m_id', right_on='movie_id').head()
#Hidden Note : If multiple columns needs to be used on join condition use list
#pd.merge(movies, ratings, left_on=['m_id','2ndcolumn'],right_on=['movie_id','anothercolumn']).head()

   m_id             title  user_id  movie_id  rating   timestamp
0     1  Toy Story (1995)        2         1     3.5  1141415820
1     1  Toy Story (1995)        3         1     4.0  1439472215
2     1  Toy Story (1995)        4         1     3.0  1573944252
3     1  Toy Story (1995)        5         1     4.0   858625949
4     1  Toy Story (1995)        8         1     4.0   890492517

## If index join should be considered... then specify that ... simple ...

In [85]:
ratings= ratings.set_index('movie_id')
ratings.head()

          user_id  rating   timestamp
movie_id
296             1     5.0  1147880044
306             1     3.5  1147868817
307             1     5.0  1147868828
665             1     5.0  1147878820
899             1     3.5  1147868510

In [87]:
# pd.merge(movies, ratings, left_index=True, right_index=True).head()
pd.merge(movies, ratings, left_on='m_id', right_index=True).head()

   m_id             title  user_id  rating   timestamp
0     1  Toy Story (1995)        2     3.5  1141415820
0     1  Toy Story (1995)        3     4.0  1439472215
0     1  Toy Story (1995)        4     3.0  1573944252
0     1  Toy Story (1995)        5     4.0   858625949
0     1  Toy Story (1995)        8     4.0   890492517

## Four Types of Joins
---
There are actually four types of joins supported by the Pandas merge function. Here's how they are described by the documentation:

- **inner**: use intersection of keys from both frames, similar to a SQL inner join; preserve the order of the left keys
- **outer**: use union of keys from both frames, similar to a SQL full outer join; sort keys lexicographically
- **left**: use only keys from left frame, similar to a SQL left outer join; preserve key order
- **right**: use only keys from right frame, similar to a SQL right outer join; preserve key order  

The default is the "inner join", which was used when creating the movie_ratings DataFrame.

It's easiest to understand the different types by looking at some simple examples:

### Example DataFrames A and B

In [88]:

A = pd.DataFrame({'color': ['green', 'yellow', 'red'], 'num':[1, 2, 3]})
A

    color  num
0   green    1
1  yellow    2
2     red    3

In [89]:
B = pd.DataFrame({'color': ['green', 'yellow', 'pink'], 'size':['S', 'M', 'L']})
B

    color size
0   green    S
1  yellow    M
2    pink    L

### Inner join
---
Only include observations found in both A and B:

In [91]:
pd.merge(A, B, how='inner')

    color  num size
0   green    1    S
1  yellow    2    M

### Outer join
---
Include observations found in either A or B:

In [92]:
pd.merge(A, B, how='outer')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2     red  3.0  NaN
3    pink  NaN    L

### Left join
---
Include all observations found in A:

In [58]:

pd.merge(A, B, how='left')

    color  num size
0   green    1    S
1  yellow    2    M
2     red    3  NaN

### Right join
---
Include all observations found in B:

In [93]:
pd.merge(A, B, how='right')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2    pink  NaN    L